# Практическое задание 3, вариант 14, №1.
# Даны три целых числа: A, B, C. Проверить истинность высказывания: «Каждое из чисел A, B, C положительное».

while True:
    try:
        print("Каждое из чисел A, B, C положительное.")
        A = int(input("Введите число A: "))
        B = int(input("Введите число B: "))
        C = int(input("Введите число C: "))

        if A > 0 and B > 0 and C > 0:
            print("Высказывание истинно.")
        elif A < 0 and B > 0 and C > 0:
            print("Высказывание ложно: число А меньше нуля.")
        elif B < 0 and A > 0 and C > 0:
            print("Высказывание ложно: число В меньше нуля.")
        elif C < 0 and A > 0 and B > 0:
            print("Высказывание ложно: число С меньше нуля.")
        elif A < 0 and B < 0 and C > 0:
            print("Высказывание ложно: числа А и В меньше нуля.")
        elif A < 0 and C < 0 and B > 0:
            print("Высказывание ложно: числа А и С меньше нуля.")
        elif B < 0 and C < 0 and A > 0:
            print("Высказывание ложно: числа В и С меньше нуля.")
        else:
            print("Высказывание ложно: все числа меньше нуля. ")
    except ValueError:
        print("Ошибка! Введите целые числа.")
        continue
    break