# Практическое задание 2, вариант 14
# Дано трёхзначное число. Используя одну операцию деления нацело, вывести первую цифру данного числа(сотни).

while True:
    try:
        while  True:
            a = int(input("Введите трёхзначное число: "))
            if (100 <= a <= 999):
                pch = a//100
                print(pch)
                break # конец цикла
            else:
                print("Ошибка, введите трёхзначное число.")
    except ValueError:
        print("Ошибка, введите корректное целое число.")
        continue # пропуск в случае отсутствия ошибок
    break # конец цикла
